**个人简历**
* 姓名：朱柯余              年龄:  24
* 联系方式：15600178595     邮箱：kyre0@outlook.com
* 求职意向：安全开发工程师  工作经验：4年
**教育背景**
* 西安财经大学，2016- 2020
* 专业：软件工程
**技能与专长**
* 熟悉常见的web、主机等方面的相关漏洞，并了解其原理和防御措施;
* 熟悉基础网络知识;
* 熟悉各类安全产品维护、规则调优;
* 对常见Web安全漏洞的原理、危害、利用方式及修复方案有较深入理解;
* 熟练掌握MSF、CS等工具的使用
**工作经历**
* 奇安信科技集团，2019-07 - 至今
* 职位：安全开发工程师
* 工作内容：
	+ 负责WAF、IDS、IPS、防火墙等安全产品的运维和优化;
+ 负责安全事件及告警分析，对于安全事件可以第一时间进行合理的应急处理;
	+ 参与WAF,DNS检测系统架构设计与优化;
	+ 完成Webshell检测模块的设计以及负责检测能力和优化功能;
	+ 与团队成员协作，共同解决项目中的技术难题
**项目经验**
* IPS、IDS送测入围项目,2020-2023                   
* 项目描述 [简要描述项目的背景、目标和成果]
* 角色与贡献
+ 负责控制规则的检出率以及误报率达到项目要求
+ 开发以及优化ips规则
+ 与引擎开发团队协同工作，优化后台检测逻辑

* 冬奥、重保、HW、nox应急响应,2020-至今
* 项目描述:
* 角色与贡献：
+ 负责漏洞分析以及规则维护优化。
+ 应急响应及时分析漏洞。
+ 提升安全检测能力。

* WAF防火墙产品开发,2022-至今                              
* 项目描述: 
* 角色与贡献:
+ 设计WAF产品检测逻辑以及规则语法
+ 增加了webshell的防御检测规则，负责规则优化
+ 提升了web防火墙安全能力

* DNS流量检测产品，2023-至今                
* 项目描述：
* 角色与贡献：
+ 负责样本分析以及收集，深入研究dns流量检测技术
+ 调研分析DNS隧道样本，提出检测思路

* Botnet样本逆向分析，2023-至今                     
* 项目描述：[简要描述项目的背景、目标和成果]
* 角色与贡献:
+ 逆向分析botnet/malware样本,提出检测思路
+ 分析了解了常见家族的流量特征
+ 开发了自动化工具，实现对已知c2连接流量的实时分析
* IPS、IDS安全能力运维，2019-2023
* 项目描述：[简要描述项目的背景、目标和成果]
* 角色与贡献：
	+ 负责[具体模块或功能]的开发与实现
	+ 优化系统性能，提升用户体验
	+ 协助团队完成项目进度控制和质量保证
**自我评价**
* 对安全技术有浓厚的兴趣和持续学习的动力
* 具备良好的分析问题和解决问题的能力

